package algorithms.arrays.intersection_of_two_arrays
/**
 * 两个数组的交集
 * https://www.geekxh.com/1.0.%E6%95%B0%E7%BB%84%E7%B3%BB%E5%88%97/001.html#_01%E3%80%81%E9%A2%98%E7%9B%AE%E5%88%86%E6%9E%90
 * 同时来自 leetcode 350题 https://leetcode-cn.com/problems/intersection-of-two-arrays-ii/
 *
 *给定两个数组，编写一个函数来计算它们的交集。
 * 输入: nums1 = [1,2,2,1], nums2 = [2,2]
 *
 * 输出: [2,2]
 *
 * 输入: nums1 = [4,9,5], nums2 = [9,4,9,8,4]
 *
 * 输出: [4,9]
 *
 *
 * 注意，输出的元素要与 两个数组中出现的最小值一致， 比如第一个例子都是2,2都是出现两次,那后面也必须要出现两次
 *
 * 上面的 4,9 ，第一个数组中只出现一次，第二个数组中出现了两次，那么最小值就是一次
 * 4,和9 只需要出现一次就行
 */

/**
 * 进阶
 * 如果给定的数组已经排好序呢？你将如何优化你的算法？
如果 nums1 的大小比 nums2 小很多，哪种方法更优？
如果 nums2 的元素存储在磁盘上，内存是有限的，并且你不能一次加载所有的元素到内存中，你该怎么办？
 */
fun main() {

}

